Revit 2024 API
FaceSplitter.GetBoundaries Method
 Gets the boundaries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public IList<CurveLoop> GetBoundaries()
Visual Basic
Public Function GetBoundaries As IList(Of CurveLoop)
Visual C++
public:
IList<CurveLoop^>^ GetBoundaries()
Return Value
 The face splitter boundaries.
See Also
FaceSplitter Class
Autodesk.Revit.DB Namespace